Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: "(Func1|Method) failed"); } // Death assertions can be used anywhere in a function.
it_it: "(Func1|Method) failed"); } // Le asserzioni death possono essere utilizzate ovunque in una funzione.

source: "Catching" Failures
it_it: "Catching" degli Errori

source: #3 and #4 can be done either in one thread or in multiple threads - anyway you want.
it_it: #3 e #4 possono essere eseguiti in un thread o in più thread, - come si vuole.

source: #include "path/to/mock_foo.h" // The definitions may appear trivial, but the functions actually do a // lot of things through the constructors/destructors of the member // variables used to implement the mock methods.
it_it: #include "path/to/mock_foo.h" // Le definizioni possono sembrare banali, ma le funzioni in realtà fanno // molte cose attraverso i costruttori/distruttori delle variabili membro // utilizzate per implementare i metodi mock.

source: #include "this/package/foo.h" #include <gtest/gtest.h> namespace my { namespace project { namespace { // The fixture for testing class Foo.
it_it: #include "this/package/foo.h" #include <gtest/gtest.h> namespace my { namespace project { namespace { // La fixture per estare la classe Foo.

source: #include <algorithm> #include <vector> using ::testing::Matches; using ::testing::Ge; vector<int> v; ... // How many elements in v are >= 10?
it_it: #include <algorithm> #include <vector> using ::testing::Matches; using ::testing::Ge; vector<int> v; ... // Quanti elementi in v sono >= 10?

source: #include <gtest/gtest.h> // Demonstrate some basic assertions.
it_it: #include <gtest/gtest.h> // Mostra della asserzioni basilari.

source: $ foo_test --gtest_repeat=-1 A negative count means repeating forever.
it_it: $ foo_test --gtest_repeat=-1 Un conteggio negativo significa ripetere all'infinito.

source: $ foo_test --gtest_repeat=1000 Repeat foo_test 1000 times and don't stop at failures.
it_it: $ foo_test --gtest_repeat=1000 Ripeti foo_test 1000 volte e non fermarti ai fallimenti.

source: $ foo_test --gtest_repeat=1000 --gtest_break_on_failure Repeat foo_test 1000 times, stopping at the first failure.
it_it: $ foo_test --gtest_repeat=1000 --gtest_break_on_failure Ripete foo_test 1000 volte, fermandosi al primo fallimento.

source: $ foo_test --gtest_repeat=1000 --gtest_filter=FooBar.* Repeat the tests whose name matches the filter 1000 times.
it_it: $ foo_test --gtest_repeat=1000 --gtest_filter=FooBar.* Ripeti 1000 volte i test il cui nome corrisponde al filtro.

source: (#including .cc files is not a good way to reuse code - you should not do this in production code!)
it_it: (#includere i file .cc non è un buon modo per riutilizzare il codice: non lo si dovrebbe fare nel codice di produzione!)

source: (#including `.cc` files is not a good way to reuse code - you should not do this in production code!)
it_it: (#includere i file `.cc` non è un buon modo per riutilizzare il codice: non lo si dovrebbe fare nel codice di produzione!)

source: () to delete the N'th (zero-indexed) argument:
it_it: ()` per cancellare l'N-esimo (partendo da zero) argomento:

source: (Const() is defined by gMock and returns a const reference to its argument.)
it_it: (Const() è definito da gMock e restituisce un riferimento const al suo argomento).

source: (_F stands for "Fixture").
it_it: (_F sta per "Fixture").

source: (Early versions of gcc doesn't force you to initialize the const member.
it_it: (Le prime versioni di gcc non obbligano a inizializzare il membro const.

source: (Early versions of `gcc` doesn't force you to initialize the const member.
it_it: (Le prime versioni di `gcc` non obbligano a inizializzare il membro const.

source: (For testing whether an optional<> is set, check for equality with nullopt.
it_it: (Per testare se è impostato un optional<>, verificare l'uguaglianza con nullopt.

source: (For testing whether an `optional<>` is set, check for equality with `nullopt`.
it_it: (Per testare se è impostato un `optional<>`, verificare l'uguaglianza con `nullopt`.

source: (If the name Die() clashes with an existing symbol, choose another name.) Now, we have translated the problem of testing when a MockFoo object dies to testing when its Die() method is called:
it_it: (Se il nome Die() entra in conflitto con un simbolo esistente, si sceglie un altro nome). Ora, abbiamo tradotto il problema di testare quando un oggetto MockFoo muore nel testare quando viene chiamato il metodo Die():

source: (If the name `Die()` clashes with an existing symbol, choose another name.) Now, we have translated the problem of testing when a `MockFoo` object dies to testing when its `Die()` method is called:
it_it: (Se il nome `Die()` entra in conflitto con un simbolo esistente, si sceglie un altro nome). Ora, abbiamo tradotto il problema di testare quando un oggetto `MockFoo` "muore" nel testare quando viene chiamato il metodo `Die()`:

source: (It goes without saying that all pure virtual methods in your abstract class must be either mocked or overridden.)
it_it: (Inutile dire che tutti i metodi virtuali puri nella classe astratta devono essere mock-ati o sovrascritti).

source: (It goes without saying that *all* pure virtual methods in your abstract class must be either mocked or overridden.)
it_it: (Inutile dire che *tutti* i metodi virtuali puri nella classe astratta devono essere mock-ati o sovrascritti).

source: (Note that the destructor of Turtle must be virtual, as is the case for all classes you intend to inherit from - otherwise the destructor of the derived class will not be called when you delete an object through a base pointer, and you'll get corrupted program states like memory leaks.)
it_it: (Notare che il distruttore di Turtle deve essere virtual, come nel caso di tutte le classi da cui si intende ereditare - altrimenti il distruttore della classe derivata non verrà chiamata quando si elimina un oggetto tramite un puntatore base e si otterranno stati del programma danneggiati come i memory leak).

source: (Note that the destructor of `Turtle` **must** be virtual, as is the case for **all** classes you intend to inherit from - otherwise the destructor of the derived class will not be called when you delete an object through a base pointer, and you'll get corrupted program states like memory leaks.)
it_it: (Notare che il distruttore di `Turtle` **deve** essere virtual, come nel caso di **tutte** le classi da cui si intende ereditare - altrimenti il distruttore della classe derivata non verrà chiamata quando si elimina un oggetto tramite un puntatore base e si otterranno stati del programma danneggiati come i memory leak).

source: (Please read the previous section first if you haven't.)
it_it: (Se non è stato fatto, è opportuno leggere prima la sezione precedente).

source: (Please read the [previous](#asserting-using-gmock-matchers) section first if you haven't.)
it_it: (Se non è stato fatto, è opportuno leggere prima la sezione [precedente](#asserting-using-gmock-matchers)).

source: (This behavior was chosen for the action to be safe when value is a proxy object that references some temporary objects.) As a result, std::ref(x) is converted to an int value (instead of a const int&) when the expectation is set, and Return(std::ref(x)) will always return 0.
it_it: (Questo comportamento è stato scelto perché l'azione fosse sicura quando value è un oggetto proxy che fa riferimento ad alcuni oggetti temporanei). Di conseguenza, std::ref(x) è convertito in un valore int (anziché un const int&) quando la expectation è impostata e Return(std::ref(x)) restituirà sempre 0.

source: (This behavior was chosen for the action to be safe when `value` is a proxy object that references some temporary objects.) As a result, `std::ref(x)` is converted to an `int` value (instead of a `const int&`) when the expectation is set, and `Return(std::ref(x))` will always return 0.
it_it: (Questo comportamento è stato scelto perché l'azione fosse sicura quando `value` è un oggetto proxy che fa riferimento ad alcuni oggetti temporanei). Di conseguenza, `std::ref(x)` è convertito in un valore `int` (anziché un `const int&`) quando la expectation è impostata e `Return(std::ref(x))` restituirà sempre 0.

source: (This is an invariant.) Here's how we can write and use a matcher class to do so:
it_it: (Questo è un invariante). Ecco come possiamo scrivere e utilizzare una classe matcher per farlo:

source: (Well, almost.)
it_it: (Be' quasi).

source: (What if you care about the relative order of some of the calls, but not all of them?
it_it: (E se interessa l'ordine relativo di alcune chiamate, ma non di tutte?

source: (Why don't we just write { return foo.Concrete(str); }?
it_it: (Perché non scrivere semplicemente { return foo.Concrete(str); }?

source: (Why don't we just write `{ return foo.Concrete(str); }`?
it_it: (Perché non scrivere semplicemente `{ return foo.Concrete(str); }`?

source: (Why using a comma?
it_it: (Perché si usa una virgola?

source: (Yes, C++ allows a subclass to change the access level of a virtual function in the base class.) Example:
it_it: (Sì, il C++ consente a una sottoclasse di modificare il livello di accesso di una funzione virtuale nella classe base). Esempio:

source: (You can't really expect Foo's maintainer to fix every test that uses Foo, can you?)
it_it: (Non ci si può certo aspettare che il manutentore di Foo corregga ogni test che usa Foo, vero?)

source: (You can't really expect `Foo`'s maintainer to fix every test that uses `Foo`, can you?)
it_it: (Non ci si può certo aspettare che il manutentore di `Foo` corregga ogni test che usa `Foo`, vero?)

source: (You could add an extra message to each assertion in Sub1() to indicate the value of n, but that's tedious.)
it_it: (Si potrebbe aggiungere un messaggio extra a ciascuna asserzione in Sub1() per indicare il valore di n, ma è noioso).

source: (You could add an extra message to each assertion in `Sub1()` to indicate the value of `n`, but that's tedious.)
it_it: (Si potrebbe aggiungere un messaggio extra a ciascuna asserzione in `Sub1()` per indicare il valore di `n`, ma è noioso).

source: (`Const()` is defined by gMock and returns a `const` reference to its argument.)
it_it: (`Const()` è definito da gMock e restituisce un riferimento `const` al suo argomento).

source: (`_F` stands for "Fixture").
it_it: (`_F` sta per "Fixture").

source: (gMock's philosophy is that saying nothing means there is no constraint.) However, it leads to a warning, as it might indicate a problem (e.g. the test author might have forgotten to specify a constraint).
it_it: (La filosofia di gMock è che non dire nulla significa che non ci sono vincoli). Tuttavia, porta a un warning, poiché potrebbe indicare un problema (ad esempio l'autore del test potrebbe aver dimenticato di specificare un vincolo).

source: (gMock's philosophy is that saying nothing means there is no constraint.) However, it leads to a warning, as it *might* indicate a problem (e.g. the test author might have forgotten to specify a constraint).
it_it: (La filosofia di gMock è che non dire nulla significa che non ci sono vincoli). Tuttavia, porta a un warning, poiché *potrebbe* indicare un problema (ad esempio l'autore del test potrebbe aver dimenticato di specificare un vincolo).

source: (in the case of ASSERT_EXIT and EXPECT_EXIT) does the exit status satisfy predicate?
it_it: (nel caso di ASSERT_EXIT e di EXPECT_EXIT) lo stato di uscita soddisfa il predicato?

source: (in the case of `ASSERT_EXIT` and `EXPECT_EXIT`) does the exit status satisfy `predicate`?
it_it: (nel caso di `ASSERT_EXIT` e di `EXPECT_EXIT`) lo stato di uscita soddisfa il `predicato`?

source: (note that ~Foo() must be virtual) we can define its mock as
it_it: (notare che ~Foo() deve essere virtual) possiamo definirne il mock come

source: (note that `~Foo()` **must** be virtual) we can define its mock as
it_it: (notare che `~Foo()` **deve** essere virtual) possiamo definirne il mock come

source: (note that all member functions that are mocked, including ~StackInterface() must be virtual).
it_it: (notare che il mock di tutte le funzioni membro, compreso ~StackInterface() devono essere virtual).

source: (note that all member functions that are mocked, including `~StackInterface()` **must** be virtual).
it_it: (notare che il mock di tutte le funzioni membro, compreso `~StackInterface()` **devono** essere virtual).

source: **A good test verifies the contract of the code.** If a test over-specifies, it doesn't leave enough freedom to the implementation.
it_it: **Un buon test verifica il contratto del codice**. Se un test specifica eccessivamente, non lascia abbastanza libertà all'implementazione.

source: **An unexpected call is always an error,** as the code under test doesn't behave the way the test expects it to behave.
it_it: **Una chiamata unexpected è sempre un errore**, poiché il codice sottoposto a test non si comporta come il test si aspetta che si comporti.

source: **Availability**: Linux, Windows, Mac.
it_it: **Disponibilità**: Linux, Windows, Mac.

source: **BEST PRACTICE:** Prefer to make the comparison explicit via `EXPECT_THAT(actual_value, Eq(expected_value))` or `EXPECT_EQ(actual_value, expected_value)`.
it_it: **BEST PRACTICE:** È preferibile rendere esplicito il confronto tramite `EXPECT_THAT(actual_value, Eq(expected_value))` o `EXPECT_EQ(actual_value, expected_value)`.

source: **By default, an uninteresting call is not an error,** as it violates no constraint specified by the test.
it_it: **Per default, una chiamata uninteresting non è un errore**, poiché non viola alcun vincolo specificato dal test.

source: **Caveat**: When used inside a member function of a class template or a function template, `StaticAssertTypeEq<T1, T2>()` is effective only if the function is instantiated.
it_it: **Avvertenza**: Se utilizzato all'interno di una funzione membro di una classe template o di una funzione template, `StaticAssertTypeEq<T1, T2>()` è efficace solo se viene istanziata la funzione.

source: **Fake** objects have working implementations, but usually take some shortcut (perhaps to make the operations less expensive), which makes them not suitable for production.
it_it: Gli oggetti **fake** hanno implementazioni funzionanti, ma solitamente prendono qualche scorciatoia (magari per rendere le operazioni meno costose), che li rende non adatti alla produzione.

source: **If you omit `Times()`, gMock will infer the cardinality for you.** The rules are easy to remember:
it_it: **Se si omette `Times()`, gMock dedurrà autonomamente la cardinalità**. Le regole sono facili da ricordare:

source: **If you still find yourself needing to test internal implementation code, consider if there's a better design.** The desire to test internal implementation is often a sign that the class is doing too much.
it_it: **Se ci si ritrova ancora a dover testare il codice dell'implementazione interna, considerare se esiste un design migliore**. Il desiderio di testare l'implementazione interna è spesso un segno che la classe sta facendo troppo.

source: **Important note:** The `EXPECT_CALL()` statement evaluates the action clause only once, even though the action may be performed many times.
it_it: **Nota importante** L'istruzione `EXPECT_CALL()` valuta la clausola dell'azione una sola volta, anche se l'azione può essere eseguita più volte.

source: **Important note:** gMock requires expectations to be set **before** the mock functions are called, otherwise the behavior is **undefined**.
it_it: **Nota importante:** gMock richiede che le expectation siano impostate **prima** di chiamare le funzioni mock, altrimenti il comportamento è **indefinito**.

source: **Mocks** are objects pre-programmed with *expectations*, which form a specification of the calls they are expected to receive.
it_it: I **mocks** sono oggetti preprogrammati con delle *expectation*, che formano una specifica delle chiamate che si aspettano di ricevere.

source: **Notes:**
it_it: **Note:**

source: **Quick quiz:** what do you think will happen if a function is expected to be called twice but actually called four times?
it_it: **Quiz veloce:** cosa accadrà se si prevede che una funzione venga chiamata due volte ma in realtà viene chiamata quattro volte?

source: **Some tips:**
it_it: **Alcuni suggerimenti:**

source: **Tip 1:** If you run the test from an Emacs buffer, you can hit `<Enter>` on the line number to jump right to the failed expectation.
it_it: **Tip 1:** Se si esegue il test da un buffer Emacs, si può premere `<Invio>` sul numero di riga per passare direttamente alla expectation non riuscita.

source: **Tip 2:** If your mock objects are never deleted, the final verification won't happen.
it_it: **Tip 2:** Se gli oggetti mock non vengono mai eliminati, la verifica finale non avrà luogo.

source: **Tips:**
it_it: **Suggerimenti:**

source: **`Calltype(...)`** - Sets the call type for the method (e.g. to `STDMETHODCALLTYPE`), useful in Windows.
it_it: **`Calltype(...)`** - Imposta il tipo di chiamata per il metodo (ad esempio su `STDMETHODCALLTYPE`), utile in Windows.

source: **`ON_CALL`** is likely the *single most under-utilized construct* in gMock.
it_it: **`ON_CALL`** è probabilmente il *costrutto singolo più sotto-utilizzato* in gMock.

source: **`const`** - Makes the mocked method a `const` method.
it_it: **`const`** - Rende il metodo mock-ato un metodo `const`.

source: **`noexcept`** - Marks the method with `noexcept`.
it_it: **`noexcept`** - Contrassegna il metodo con `noexcept`.

source: **`override`** - Marks the method with `override`.
it_it: **`override`** - Contrassegna il metodo con `override`.

source: **`ref(...)`** - Marks the method with the reference qualification specified.
it_it: **`ref(...)`** - Contrassegna il metodo con la qualifica del riferimento specificata.

source: **gMock** is a library (sometimes we also call it a "framework" to make it sound cool) for creating mock classes and using them.
it_it: **gMock** è una libreria (a volte la chiamiamo anche "framework" per farlo sembrare interessante) per creare classi mock e utilizzarle.

source: *Does not* set any expectations that the method will be called.
it_it: *Non* imposta alcuna expectation che il metodo verrà chiamato.

source: *GoogleTest* helps you write better C++ tests.
it_it: *GoogleTest* aiuta a scrivere meglio i test di C++.

source: *Having a nice mock doesn't change the severity of an unexpected call.*
it_it: *Avere un mock nice non cambia la gravità di una chiamata unexpected*.

source: *Tests* use assertions to verify the tested code's behavior.
it_it: *Tests* utilizzano le asserzioni per verificare il comportamento del codice in esame.

source: *The idea for this assertion was borrowed from Joe Walnes' Hamcrest project, which adds `assertThat()` to JUnit.*
it_it: *L'idea per questa asserzione è stata presa in prestito dal progetto Hamcrest di Joe Walnes, che aggiunge `assertThat()` a JUnit.*

source: *Type-parameterized tests* are like typed tests, except that they don't require you to know the list of types ahead of time.
it_it: I *Type-parameterized tests* sono come quelli tipizzati, tranne per il fatto che non richiedono che si conosca in anticipo l'elenco dei tipi.

source: *Typed tests* allow you to repeat the same test logic over a list of types.
it_it: I *Test tipizzati* consentono di ripetere la stessa logica del test su un elenco di tipi.

source: *Uninteresting* calls and *unexpected* calls are different concepts in gMock.
it_it: Le chiamate *Uninteresting* e quelle *unexpected* sono concetti diversi in gMock.

source: *Value-parameterized tests* allow you to test your code with different parameters without writing multiple copies of the same test.
it_it: I *test con valori parametrizzati* consentono di testare il codice con parametri diversi senza scrivere più copie dello stesso test.

source: *Very* different.
it_it: *Molto* diversi.

source: *`TestFixtureName`* must be the name of a test fixture class—see [Test Fixtures](../primer.md#same-data-multiple-tests).
it_it: *`TestFixtureName`* deve essere il nome di una classe fixture di test; vedere [Test Fixtures](../primer.md#same-data-multiple-tests).

source: *`TestFixtureName`* must be the name of a value-parameterized test fixture class—see [Value-Parameterized Tests](../advanced.md#value-parameterized-tests).
it_it: *`TestFixtureName`* deve essere il nome di una classe fixture con valori parametrizzati; vedere [Test con Valori Parametrizzati](../advanced.md#value-parameterized-tests).

source: *`key`* must be a valid XML attribute name, and cannot conflict with the ones already used by GoogleTest (`name`, `status`, `time`, `classname`, `type_param`, and `value_param`).
it_it: *`key`* deve essere un nome di un attributo XML valido e non può entrare in conflitto con quelli già utilizzati da GoogleTest (`name`, `status`, `time`, `classname`, `type_param`, e `value_param`).

source: ... }; // A mock packet stream class.
it_it: ... }; // Una classe mock per lo stream di packet.

source: ... }; // Derives a fixture FooTest from BaseTest.
it_it: ... }; // Deriva una fixture FooTest da BaseTest.

source: ... additional set-up work ...
it_it: ... ulteriori impostazioni ...

source: ... clean-up work for FooTest ...
it_it: ... ripulitura di FooTest ...

source: ... code that uses mock_foo ...
it_it: ... codice che usa mock_foo ...

source: ... code that uses mock_foo ... }
it_it: ... codice che usa mock_foo ... }

source: ... definition of class MyClass ... }; } // namespace my_namespace
it_it: ... definizione della classe MyClass ... }; } // namespace my_namespace

source: ... definition of the class Foo ... }; } // namespace my_namespace
it_it: ... definizione della classe Foo ... }; } // namespace my_namespace

source: ... functions and variables for FooTest ... }; // Tests that use the fixture FooTest.
it_it: ... funzioni e variabili per FooTest ... }; // Test che usano la fixture FooTest.

source: ... more mock methods ... };
it_it: ... altri metodi mock ... };

source: ... use in_range as a matcher in multiple EXPECT_CALLs ...
it_it: ... usare in_range come matcher nelle EXPECT_CALL multiple...

source: ... you can refer to shared_resource_ here ... }
it_it: ... qui si può far riferimento a shared_resource_ ... }

source: ... you can refer to shared_resource_ here ... } TEST_F(FooTest, Test2) {
it_it: ... qui si può far riferimento a shared_resource_ ... } TEST_F(FooTest, Test2) {

source: .After(all_inits); // Expect Describe() call after all InitElement() calls
it_it: .After(all_inits); // Ci si aspetta la chiamata a Describe() dopo tutte le chiamate di InitElement()

source: .After(expectations...) // Can be used any number of times
it_it: .After(expectations...) // Può essere utilizzato un numero qualsiasi di volte

source: .InSequence(sequences...) // Can be used any number of times
it_it: .InSequence(sequences...) // Può essere utilizzato un numero qualsiasi di volte

source: .RetiresOnSaturation(); // Can be used at most once
it_it: .RetiresOnSaturation(); // Può essere utilizzato al massimo una volta

source: .Times(cardinality) // Can be used at most once
it_it: .Times(cardinality) // Può essere utilizzato al massimo una volta

source: .WillByDefault(action); // Required
it_it: .WillByDefault(action); // Necessario

source: .WillOnce(Invoke(IsVisibleInQuadrant1)); // Uh, won't compile.
it_it: .WillOnce(Invoke(IsVisibleInQuadrant1)); // Uh, non verrà compilato.

source: .WillOnce(Invoke(MyIsVisibleInQuadrant1)); // Now it works.
it_it: .WillOnce(Invoke(MyIsVisibleInQuadrant1)); // Ora funziona.

source: .WillOnce(Return(42)) // Return 42 on the first call
it_it: .WillOnce(Return(42)) // Restituisce 42 alla prima chiamata
